## Plan Result (sbox_finops_reporting - TerraformPlanApply)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_logic_app_workflow.finopslogicapp




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_logic_app_workflow.finopslogicapp will be created
  + resource "azurerm_logic_app_workflow" "finopslogicapp" {
      + access_endpoint                 = (known after apply)
      + connector_endpoint_ip_addresses = (known after apply)
      + connector_outbound_ip_addresses = (known after apply)
      + enabled                         = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "finopsdatasboxlogicapp"
      + resource_group_name             = "finopsdatasboxrg"
      + tags                            = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/finops-reporting"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
      + workflow_endpoint_ip_addresses  = (known after apply)
      + workflow_outbound_ip_addresses  = (known after apply)
      + workflow_schema                 = "https://schema.management.azure.com/providers/Microsoft.Logic/schemas/2016-06-01/workflowdefinition.json#"
      + workflow_version                = "1.0.0.0"

      + identity {
          + identity_ids = [
              + "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/finopsdatasboxrg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/finopslogicapp-sbox-mi",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label sbox_finops_reporting - TerraformPlanApply/add-or-update: POST https://api.github.com/repos/hmcts/finops-reporting/issues/21/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":21,"Program":"tfcmt","SHA1":"","Target":"sbox_finops_reporting - TerraformPlanApply","Vars":{}} -->